/**
 * Αντικειμενοστρεφή Ανάπτυξη Λογισμικού 4η Εργασία ΚΛΗΡΟΝΟΜΙΚΟΤΗΤΑ
 * 
 * @author Χρήστος Δεμερτζής, mai19013
 * 
 */
public class Main {

  public static void main(String[] args) {

    /**
     * Δημιουργείται το μητρώο των στοιχείων μισθοδοσίας για το υποκατάστημα που
     * βρίσκεται στη Θεσσαλονίκη, Εγνατία 120 (αντικείμενο της κλάσης
     * PayrollRegistry)
     */
    PayrollRegistry branch1 = new PayrollRegistry("Εγνατία", "Θεσσαλονίκη", "120");
    /**
     * δημιουργείται ένας ωρομίσθιος υπάλληλος με όνομα Νικολάου Γιώργιος, ΑΦΜ
     * 067832710 και ωριαία αποζημίωση 5 Ευρώ και αποθηκεύεται στο μητρώο
     */

    branch1.addEmployee(new PartTimeEmployee("Νικολάου Γιώργος", "067832710", 5));
    /**
     * δημιουργείται ένας υπάλληλος πλήρους απασχόλησης με όνομα Μανδέλης Γιώργος,
     * ΑΦΜ 067832711 και μηνιαίο μισθό 1300 Ευρώ - και αποθηκεύεται στο μητρώο
     */
    branch1.addEmployee(new FullTimeEmployee("Μανδέλης Γιώργος", "067832711", 1300));
    /**
     * καλείται για το μητρώο και για τον μήνα ΔΕΚΕΜΒΡΙΟ 2018 η μέθοδος ενημέρωσης
     * των ωρών εργασίας και στη συνέχεια η μέθοδος εμφάνισης της μισθοδοσίας όλων
     * των υπαλλήλων.
     */
    branch1.updateMonthHours("Δεκεμβριος", "2018");
    branch1.printPayroll("Δεκεμβριος", "2018");
  }

}